# Importing data

In [89]:
# 1. Import Libraries
import pandas as pd
import numpy as np
import os

# path
path = r'C:\Users\ANITA BOADU\Achievement 4'

# =========================================
# 2. Loaded Data
# =========================================

# Load orders data
df_ords = pd.read_csv(os.path.join(path, 'Data', 'Original Data', 'orders.csv'))

# Load products data
df_prods = pd.read_csv(os.path.join(path, 'Data', 'Original Data', 'products.csv'))

# Load departments data
df_dep = pd.read_csv(os.path.join(path, 'Data', 'Original Data', 'departments.csv'))

# =========================================
# 3. Clean Departments Data
# =========================================

# Transpose departments to get a usable structure
df_dep = df_dep.T.reset_index()
df_dep.columns = ['department_id', 'department']  # Rename columns
df_dep = df_dep[df_dep['department'] != 'department']  # Remove repeated header
df_dep['department_id'] = df_dep['department_id'].astype(int)  # Convert to int

# Ensure products department_id is int for merging
df_prods['department_id'] = df_prods['department_id'].astype(int)

# Merge products with departments
df_prods = df_prods.merge(df_dep, on='department_id', how='left')

# =========================================
# 4. Subset for Breakfast Items
# =========================================

# Breakfast department
breakfast_dept = ['breakfast']

# Filter products for breakfast
df_breakfast = df_prods[df_prods['department'].isin(breakfast_dept)]

# Keep only relevant columns
df_breakfast = df_breakfast[['product_id', 'product_name', 'department']]

# Preview breakfast items
print("Breakfast items:")
print(df_breakfast.head())

# =========================================
# 5. Subset for Dinner-Party Items
# =========================================

# Dinner-party departments
dinner_departments = ['alcohol', 'deli', 'beverages', 'meat seafood']

# Filter products for dinner-party
df_dinner = df_prods[df_prods['department'].isin(dinner_departments)]

# Keep only relevant columns
df_dinner = df_dinner[['product_id', 'product_name', 'department']]

# Preview dinner-party items
print("\nDinner-party items:")
print(df_dinner.head())

# =========================================
# 6. Analyze User Behavior (Example: user_id = 1)
# =========================================

# Extract all orders for user_id 1
user_1_orders = df_ords[df_ords['user_id'] == 1]

# Display basic stats about user 1
print("\nUser 1 behavior stats:")
print("Total orders:", user_1_orders.shape[0])
print("First order ID:", user_1_orders['order_id'].min())
print("Last order ID:", user_1_orders['order_id'].max())
print("Average days since prior order:", user_1_orders['days_since_prior_order'].mean())
print("Most common order hour:", user_1_orders['order_hour_of_day'].mode()[0])

Breakfast items:
     product_id                                      product_name department
27           28                                 Wheat Chex Cereal  breakfast
33           34                                               NaN  breakfast
67           68                           Pancake Mix, Buttermilk  breakfast
89           90                                      Smorz Cereal  breakfast
210         211  Gluten Free Organic Cereal Coconut Maple Vanilla  breakfast

Dinner-party items:
    product_id                                    product_name    department
2            3            Robust Golden Unsweetened Oolong Tea     beverages
6            7                  Pure Coconut Water With Orange     beverages
9           10  Sparkling Orange Juice & Prickly Pear Beverage     beverages
10          11                               Peach Mango Juice     beverages
16          17                               Rendered Duck Fat  meat seafood

User 1 behavior stats:
Total orders: 11
First order ID: 431534
Last order ID: 3367565
Average days since prior order: 19.0
Most common order hour: 7

In [8]:
df_ords=df_ords.drop(columns=['eval_set'])

In [9]:
df_ords.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [10]:
df_ords.tail()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
3421078,2266710,206209,10,5,18,29.0
3421079,1854736,206209,11,4,10,30.0
3421080,626363,206209,12,1,12,18.0
3421081,2977660,206209,13,1,12,7.0
3421082,272231,206209,14,6,14,30.0

In [11]:
df_ords['days_since_prior_order'].value_counts(dropna=False)

days_since_prior_order
30.0    369323
7.0     320608
6.0     240013
4.0     221696
3.0     217005
5.0     214503
NaN     206209
2.0     193206
8.0     181717
1.0     145247
9.0     118188
14.0    100230
10.0     95186
13.0     83214
11.0     80970
12.0     76146
0.0      67755
15.0     66579
16.0     46941
21.0     45470
17.0     39245
20.0     38527
18.0     35881
19.0     34384
22.0     32012
28.0     26777
23.0     23885
27.0     22013
24.0     20712
25.0     19234
29.0     19191
26.0     19016
Name: count, dtype: int64

In [12]:
df_ords.rename(columns={'order_dow' : 'order_day_of_week'},inplace=True)

In [13]:
df_ords.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [14]:
df_ords['order_id']=df_ords['order_id'].astype('str')

In [15]:
df_ords['order_id'].dtype

dtype('O')

In [17]:
df_ords['order_hour_of_day'].value_counts()

order_hour_of_day
10    288418
11    284728
15    283639
14    283042
13    277999
12    272841
16    272553
9     257812
17    228795
18    182912
8     178201
19    140569
20    104292
7      91868
21     78109
22     61468
23     40043
6      30529
0      22758
1      12398
5       9569
2       7539
4       5527
3       5474
Name: count, dtype: int64

In [18]:
df_ords['order_hour_of_day'].value_counts().sort_index()

order_hour_of_day
0      22758
1      12398
2       7539
3       5474
4       5527
5       9569
6      30529
7      91868
8     178201
9     257812
10    288418
11    284728
12    272841
13    277999
14    283042
15    283639
16    272553
17    228795
18    182912
19    140569
20    104292
21     78109
22     61468
23     40043
Name: count, dtype: int64

In [19]:
df_ords['order_hour_of_day'].value_counts().idxmax()

np.int64(10)

####### The busiest hour for placing orders is 10 AM, which has the highest order frequency.b

In [20]:
df_dep.head()

,department_id,1,2,3,4,5,6,7,8,9,...,12,13,14,15,16,17,18,19,20,21
0,department,frozen,other,bakery,produce,alcohol,international,beverages,pets,dry goods pasta,...,meat seafood,pantry,breakfast,canned goods,dairy eggs,household,babies,snacks,deli,missing

In [21]:
df_dep.T

                             0
department_id       department
1                       frozen
2                        other
3                       bakery
4                      produce
5                      alcohol
6                international
7                    beverages
8                         pets
9              dry goods pasta
10                        bulk
11               personal care
12                meat seafood
13                      pantry
14                   breakfast
15                canned goods
16                  dairy eggs
17                   household
18                      babies
19                      snacks
20                        deli
21                     missing

In [28]:
df_dep.rename(columns={'df_dep':'df_dep_t'},inplace=True)

In [29]:
df_dep_t = df_dep.T

In [27]:
df_dep_t

                             0
department_id       department
1                       frozen
2                        other
3                       bakery
4                      produce
5                      alcohol
6                international
7                    beverages
8                         pets
9              dry goods pasta
10                        bulk
11               personal care
12                meat seafood
13                      pantry
14                   breakfast
15                canned goods
16                  dairy eggs
17                   household
18                      babies
19                      snacks
20                        deli
21                     missing

In [30]:
df_dep_t.reset_index()

            index                0
0   department_id       department
1               1           frozen
2               2            other
3               3           bakery
4               4          produce
5               5          alcohol
6               6    international
7               7        beverages
8               8             pets
9               9  dry goods pasta
10             10             bulk
11             11    personal care
12             12     meat seafood
13             13           pantry
14             14        breakfast
15             15     canned goods
16             16       dairy eggs
17             17        household
18             18           babies
19             19           snacks
20             20             deli
21             21          missing

In [33]:
new_header

0    department
Name: department_id, dtype: object

In [34]:
df_dep_t_new

department_id       department
1                       frozen
2                        other
3                       bakery
4                      produce
5                      alcohol
6                international
7                    beverages
8                         pets
9              dry goods pasta
10                        bulk
11               personal care
12                meat seafood
13                      pantry
14                   breakfast
15                canned goods
16                  dairy eggs
17                   household
18                      babies
19                      snacks
20                        deli
21                     missing

In [35]:
df_dep_t_new

department_id       department
1                       frozen
2                        other
3                       bakery
4                      produce
5                      alcohol
6                international
7                    beverages
8                         pets
9              dry goods pasta
10                        bulk
11               personal care
12                meat seafood
13                      pantry
14                   breakfast
15                canned goods
16                  dairy eggs
17                   household
18                      babies
19                      snacks
20                        deli
21                     missing

In [36]:
data_dict

{'1': {'department': 'frozen'},
 '2': {'department': 'other'},
 '3': {'department': 'bakery'},
 '4': {'department': 'produce'},
 '5': {'department': 'alcohol'},
 '6': {'department': 'international'},
 '7': {'department': 'beverages'},
 '8': {'department': 'pets'},
 '9': {'department': 'dry goods pasta'},
 '10': {'department': 'bulk'},
 '11': {'department': 'personal care'},
 '12': {'department': 'meat seafood'},
 '13': {'department': 'pantry'},
 '14': {'department': 'breakfast'},
 '15': {'department': 'canned goods'},
 '16': {'department': 'dairy eggs'},
 '17': {'department': 'household'},
 '18': {'department': 'babies'},
 '19': {'department': 'snacks'},
 '20': {'department': 'deli'},
 '21': {'department': 'missing'}}

In [37]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [38]:
print(data_dict.get('4'))

{'department': 'produce'}

####### According to the data dictionary, a department_id value of 4 corresponds to the Produce department.

In [40]:
df_breakfast = df_prods[df_prods['department_id'] == 13]

In [41]:
df_breakfast

,product_id,product_name,aisle_id,department_id,prices
1,2,All-Seasons Salt,104,13,9.3
4,5,Green Chile Anytime Sauce,5,13,4.3
49,50,Pumpkin Muffin Mix,105,13,11.3
64,65,Organic Red Wine & Olive Oil Dressing Organic,89,13,12.4
66,67,"Jelly, Blackberry",88,13,4.9
...,...,...,...,...,...
49646,49642,Candy Eyeballs,97,13,11.9
49647,49643,Tomatillo Salsa Cranberry-Mango,51,13,9.4
49658,49654,"Teriyaki Sauce, Sesame, Original",5,13,4.0
49663,49659,Organic Creamed Coconut,17,13,3.1
49684,49680,All Natural Creamy Caesar Dressing,89,13,4.9

In [42]:
df_breakfast_subset = df_breakfast[['product_id', 'product_name', 'department_id']]

In [43]:
df_breakfast_subset

,product_id,product_name,department_id
1,2,All-Seasons Salt,13
4,5,Green Chile Anytime Sauce,13
49,50,Pumpkin Muffin Mix,13
64,65,Organic Red Wine & Olive Oil Dressing Organic,13
66,67,"Jelly, Blackberry",13
...,...,...,...
49646,49642,Candy Eyeballs,13
49647,49643,Tomatillo Salsa Cranberry-Mango,13
49658,49654,"Teriyaki Sauce, Sesame, Original",13
49663,49659,Organic Creamed Coconut,13
49684,49680,All Natural Creamy Caesar Dressing,13

In [44]:
dinner_departments = ['alcohol', 'deli', 'beverages', 'meat/seafood']

In [63]:
print(df_dep.head())

  department_id       1      2       3        4        5              6  \
0    department  frozen  other  bakery  produce  alcohol  international

           7     8                9  ...            12      13         14  \
0  beverages  pets  dry goods pasta  ...  meat seafood  pantry  breakfast

             15          16         17      18      19    20       21
0  canned goods  dairy eggs  household  babies  snacks  deli  missing

[1 rows x 22 columns]

In [67]:
df_dep.T.reset_index()

,index,0,1,2,3,4,5,6,7,8,...,12,13,14,15,16,17,18,19,20,21
0,index,department_id,1,2,3,4,5,6,7,8,...,12,13,14,15,16,17,18,19,20,21
1,0,department,frozen,other,bakery,produce,alcohol,international,beverages,pets,...,meat seafood,pantry,breakfast,canned goods,dairy eggs,household,babies,snacks,deli,missing

In [69]:
df_dep.columns = ['department_id', 'department']

In [70]:
df_dep = df_dep[df_dep['department'] != 'department']

In [71]:
df_dep['department_id'] = df_dep['department_id'].astype(int)

In [74]:
df_dep

    department_id       department
1               1           frozen
2               2            other
3               3           bakery
4               4          produce
5               5          alcohol
6               6    international
7               7        beverages
8               8             pets
9               9  dry goods pasta
10             10             bulk
11             11    personal care
12             12     meat seafood
13             13           pantry
14             14        breakfast
15             15     canned goods
16             16       dairy eggs
17             17        household
18             18           babies
19             19           snacks
20             20             deli
21             21          missing

In [75]:
df_dep = df_dep.reset_index(drop=True)

In [76]:
df_dep.head()

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [79]:
num_rows = df_dinner.shape[0]

In [80]:
print("Number of rows in df_dinner:", num_rows)

Number of rows in df_dinner: 7650

In [84]:
user_1_ords = df_ords[df_ords['user_id'] == 1]

In [85]:
user_1_ords

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0
5,3367565,1,prior,6,2,7,19.0
6,550135,1,prior,7,1,9,20.0
7,3108588,1,prior,8,1,14,14.0
8,2295261,1,prior,9,1,16,0.0
9,2550362,1,prior,10,4,8,30.0
10,1187899,1,train,11,4,8,14.0

In [83]:
user_1_orders = df_ords[df_ords['user_id'] == 1]

In [86]:
df_ords=df_ords.drop(columns=['eval_set'])

In [87]:
df_ords.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [90]:
df_ords.to_csv(os.path.join(path, 'Data','Prepared Data', 'orders_wrangled.csv'))

In [92]:
df_dep_t_new.to_csv(os.path.join(path, 'Data','Prepared Data', 'departments_wrangled.csv'))